Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64MC204.h
#define _DMACS1_PPST5_POSITION                   0x00000005
#define _DMACS1_PPST5_MASK                       0x00000020
#define _DMACS1_PPST5_LENGTH                     0x00000001

#define _DMACS1_PPST6_POSITION                   0x00000006
#define _DMACS1_PPST6_MASK                       0x00000040
#define _DMACS1_PPST6_LENGTH                     0x00000001

#define _DMACS1_PPST7_POSITION                   0x00000007
#define _DMACS1_PPST7_MASK                       0x00000080
#define _DMACS1_PPST7_LENGTH                     0x00000001

#define _DMACS1_LSTCH_POSITION                   0x00000008
#define _DMACS1_LSTCH_MASK                       0x00000F00
#define _DMACS1_LSTCH_LENGTH                     0x00000004

#define _DMACS1_PPST_POSITION                    0x00000000
#define _DMACS1_PPST_MASK                        0x000000FF
#define _DMACS1_PPST_LENGTH                      0x00000008

#define _DMACS1_LSTCH0_POSITION                  0x00000008
#define _DMACS1_LSTCH0_MASK                      0x00000100
#define _DMACS1_LSTCH0_LENGTH                    0x00000001

#define _DMACS1_LSTCH1_POSITION                  0x00000009
#define _DMACS1_LSTCH1_MASK                      0x00000200
#define _DMACS1_LSTCH1_LENGTH                    0x00000001

#define _DMACS1_LSTCH2_POSITION                  0x0000000A
#define _DMACS1_LSTCH2_MASK                      0x00000400
#define _DMACS1_LSTCH2_LENGTH                    0x00000001

#define _DMACS1_LSTCH3_POSITION                  0x0000000B
#define _DMACS1_LSTCH3_MASK                      0x00000800
#define _DMACS1_LSTCH3_LENGTH                    0x00000001

#define _P2TCON_PTMOD_POSITION                   0x00000000
#define _P2TCON_PTMOD_MASK                       0x00000003
#define _P2TCON_PTMOD_LENGTH                     0x00000002

#define _P2TCON_PTCKPS_POSITION                  0x00000002
#define _P2TCON_PTCKPS_MASK                      0x0000000C
#define _P2TCON_PTCKPS_LENGTH                    0x00000002

#define _P2TCON_PTOPS_POSITION                   0x00000004
#define _P2TCON_PTOPS_MASK                       0x000000F0
#define _P2TCON_PTOPS_LENGTH                     0x00000004

#define _P2TCON_PTSIDL_POSITION                  0x0000000D
#define _P2TCON_PTSIDL_MASK                      0x00002000
#define _P2TCON_PTSIDL_LENGTH                    0x00000001

#define _P2TCON_PTEN_POSITION                    0x0000000F
#define _P2TCON_PTEN_MASK                        0x00008000
#define _P2TCON_PTEN_LENGTH                      0x00000001

#define _P2TCON_PTMOD0_POSITION                  0x00000000
#define _P2TCON_PTMOD0_MASK                      0x00000001
#define _P2TCON_PTMOD0_LENGTH                    0x00000001

#define _P2TCON_PTMOD1_POSITION                  0x00000001
#define _P2TCON_PTMOD1_MASK                      0x00000002
#define _P2TCON_PTMOD1_LENGTH                    0x00000001

#define _P2TCON_PTCKPS0_POSITION                 0x00000002
#define _P2TCON_PTCKPS0_MASK                     0x00000004
#define _P2TCON_PTCKPS0_LENGTH                   0x00000001

#define _P2TCON_PTCKPS1_POSITION                 0x00000003
#define _P2TCON_PTCKPS1_MASK                     0x00000008
#define _P2TCON_PTCKPS1_LENGTH                   0x00000001

#define _P2TCON_PTOPS0_POSITION                  0x00000004
#define _P2TCON_PTOPS0_MASK                      0x00000010
#define _P2TCON_PTOPS0_LENGTH                    0x00000001

#define _P2TCON_PTOPS1_POSITION                  0x00000005
#define _P2TCON_PTOPS1_MASK                      0x00000020
#define _P2TCON_PTOPS1_LENGTH                    0x00000001

#define _P2TCON_PTOPS2_POSITION                  0x00000006
#define _P2TCON_PTOPS2_MASK                      0x00000040
#define _P2TCON_PTOPS2_LENGTH                    0x00000001

#define _P2TCON_PTOPS3_POSITION                  0x00000007
#define _P2TCON_PTOPS3_MASK                      0x00000080
#define _P2TCON_PTOPS3_LENGTH                    0x00000001

#define _P2TMR_PTMR_POSITION                     0x00000000
#define _P2TMR_PTMR_MASK                         0x00007FFF
#define _P2TMR_PTMR_LENGTH                       0x0000000F

#define _P2TMR_PTDIR_POSITION                    0x0000000F
#define _P2TMR_PTDIR_MASK                        0x00008000
#define _P2TMR_PTDIR_LENGTH                      0x00000001

#define _P2TPER_PTPER_POSITION                   0x00000000
#define _P2TPER_PTPER_MASK                       0x00007FFF
#define _P2TPER_PTPER_LENGTH                     0x0000000F

#define _P2SECMP_SEVTCMP_POSITION                0x00000000
#define _P2SECMP_SEVTCMP_MASK                    0x00007FFF
#define _P2SECMP_SEVTCMP_LENGTH                  0x0000000F

#define _P2SECMP_SEVTDIR_POSITION                0x0000000F
#define _P2SECMP_SEVTDIR_MASK                    0x00008000
#define _P2SECMP_SEVTDIR_LENGTH                  0x00000001

#define _PWM2CON1_PEN1L_POSITION                 0x00000000
#define _PWM2CON1_PEN1L_MASK                     0x00000001
#define _PWM2CON1_PEN1L_LENGTH                   0x00000001

#define _PWM2CON1_PEN1H_POSITION                 0x00000004
#define _PWM2CON1_PEN1H_MASK                     0x00000010
#define _PWM2CON1_PEN1H_LENGTH                   0x00000001

#define _PWM2CON1_PMOD1_POSITION                 0x00000008
#define _PWM2CON1_PMOD1_MASK                     0x00000100
#define _PWM2CON1_PMOD1_LENGTH                   0x00000001

#define _PWM2CON2_UDIS_POSITION                  0x00000000
#define _PWM2CON2_UDIS_MASK                      0x00000001
#define _PWM2CON2_UDIS_LENGTH                    0x00000001

#define _PWM2CON2_OSYNC_POSITION                 0x00000001
#define _PWM2CON2_OSYNC_MASK                     0x00000002
#define _PWM2CON2_OSYNC_LENGTH                   0x00000001

#define _PWM2CON2_IUE_POSITION                   0x00000002
#define _PWM2CON2_IUE_MASK                       0x00000004
#define _PWM2CON2_IUE_LENGTH                     0x00000001

#define _PWM2CON2_SEVOPS_POSITION                0x00000008
#define _PWM2CON2_SEVOPS_MASK                    0x00000F00
#define _PWM2CON2_SEVOPS_LENGTH                  0x00000004

