Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64MC204.h
#define _PWM2CON2_SEVOPS0_POSITION               0x00000008
#define _PWM2CON2_SEVOPS0_MASK                   0x00000100
#define _PWM2CON2_SEVOPS0_LENGTH                 0x00000001

#define _PWM2CON2_SEVOPS1_POSITION               0x00000009
#define _PWM2CON2_SEVOPS1_MASK                   0x00000200
#define _PWM2CON2_SEVOPS1_LENGTH                 0x00000001

#define _PWM2CON2_SEVOPS2_POSITION               0x0000000A
#define _PWM2CON2_SEVOPS2_MASK                   0x00000400
#define _PWM2CON2_SEVOPS2_LENGTH                 0x00000001

#define _PWM2CON2_SEVOPS3_POSITION               0x0000000B
#define _PWM2CON2_SEVOPS3_MASK                   0x00000800
#define _PWM2CON2_SEVOPS3_LENGTH                 0x00000001

#define _P2DTCON1_DTA_POSITION                   0x00000000
#define _P2DTCON1_DTA_MASK                       0x0000003F
#define _P2DTCON1_DTA_LENGTH                     0x00000006

#define _P2DTCON1_DTAPS_POSITION                 0x00000006
#define _P2DTCON1_DTAPS_MASK                     0x000000C0
#define _P2DTCON1_DTAPS_LENGTH                   0x00000002

#define _P2DTCON1_DTB_POSITION                   0x00000008
#define _P2DTCON1_DTB_MASK                       0x00003F00
#define _P2DTCON1_DTB_LENGTH                     0x00000006

#define _P2DTCON1_DTBPS_POSITION                 0x0000000E
#define _P2DTCON1_DTBPS_MASK                     0x0000C000
#define _P2DTCON1_DTBPS_LENGTH                   0x00000002

#define _P2DTCON1_DTA0_POSITION                  0x00000000
#define _P2DTCON1_DTA0_MASK                      0x00000001
#define _P2DTCON1_DTA0_LENGTH                    0x00000001

#define _P2DTCON1_DTA1_POSITION                  0x00000001
#define _P2DTCON1_DTA1_MASK                      0x00000002
#define _P2DTCON1_DTA1_LENGTH                    0x00000001

#define _P2DTCON1_DTA2_POSITION                  0x00000002
#define _P2DTCON1_DTA2_MASK                      0x00000004
#define _P2DTCON1_DTA2_LENGTH                    0x00000001

#define _P2DTCON1_DTA3_POSITION                  0x00000003
#define _P2DTCON1_DTA3_MASK                      0x00000008
#define _P2DTCON1_DTA3_LENGTH                    0x00000001

#define _P2DTCON1_DTA4_POSITION                  0x00000004
#define _P2DTCON1_DTA4_MASK                      0x00000010
#define _P2DTCON1_DTA4_LENGTH                    0x00000001

#define _P2DTCON1_DTA5_POSITION                  0x00000005
#define _P2DTCON1_DTA5_MASK                      0x00000020
#define _P2DTCON1_DTA5_LENGTH                    0x00000001

#define _P2DTCON1_DTAPS0_POSITION                0x00000006
#define _P2DTCON1_DTAPS0_MASK                    0x00000040
#define _P2DTCON1_DTAPS0_LENGTH                  0x00000001

#define _P2DTCON1_DTAPS1_POSITION                0x00000007
#define _P2DTCON1_DTAPS1_MASK                    0x00000080
#define _P2DTCON1_DTAPS1_LENGTH                  0x00000001

#define _P2DTCON1_DTB0_POSITION                  0x00000008
#define _P2DTCON1_DTB0_MASK                      0x00000100
#define _P2DTCON1_DTB0_LENGTH                    0x00000001

#define _P2DTCON1_DTB1_POSITION                  0x00000009
#define _P2DTCON1_DTB1_MASK                      0x00000200
#define _P2DTCON1_DTB1_LENGTH                    0x00000001

#define _P2DTCON1_DTB2_POSITION                  0x0000000A
#define _P2DTCON1_DTB2_MASK                      0x00000400
#define _P2DTCON1_DTB2_LENGTH                    0x00000001

#define _P2DTCON1_DTB3_POSITION                  0x0000000B
#define _P2DTCON1_DTB3_MASK                      0x00000800
#define _P2DTCON1_DTB3_LENGTH                    0x00000001

#define _P2DTCON1_DTB4_POSITION                  0x0000000C
#define _P2DTCON1_DTB4_MASK                      0x00001000
#define _P2DTCON1_DTB4_LENGTH                    0x00000001

#define _P2DTCON1_DTB5_POSITION                  0x0000000D
#define _P2DTCON1_DTB5_MASK                      0x00002000
#define _P2DTCON1_DTB5_LENGTH                    0x00000001

#define _P2DTCON1_DTBPS0_POSITION                0x0000000E
#define _P2DTCON1_DTBPS0_MASK                    0x00004000
#define _P2DTCON1_DTBPS0_LENGTH                  0x00000001

#define _P2DTCON1_DTBPS1_POSITION                0x0000000F
#define _P2DTCON1_DTBPS1_MASK                    0x00008000
#define _P2DTCON1_DTBPS1_LENGTH                  0x00000001

#define _P2DTCON2_DTS1I_POSITION                 0x00000000
#define _P2DTCON2_DTS1I_MASK                     0x00000001
#define _P2DTCON2_DTS1I_LENGTH                   0x00000001

#define _P2DTCON2_DTS1A_POSITION                 0x00000001
#define _P2DTCON2_DTS1A_MASK                     0x00000002
#define _P2DTCON2_DTS1A_LENGTH                   0x00000001

#define _P2FLTACON_FAEN1_POSITION                0x00000000
#define _P2FLTACON_FAEN1_MASK                    0x00000001
#define _P2FLTACON_FAEN1_LENGTH                  0x00000001

#define _P2FLTACON_FLTAM_POSITION                0x00000007
#define _P2FLTACON_FLTAM_MASK                    0x00000080
#define _P2FLTACON_FLTAM_LENGTH                  0x00000001

#define _P2FLTACON_FAOV1L_POSITION               0x00000008
#define _P2FLTACON_FAOV1L_MASK                   0x00000100
#define _P2FLTACON_FAOV1L_LENGTH                 0x00000001

#define _P2FLTACON_FAOV1H_POSITION               0x00000009
#define _P2FLTACON_FAOV1H_MASK                   0x00000200
#define _P2FLTACON_FAOV1H_LENGTH                 0x00000001

#define _P2OVDCON_POUT1L_POSITION                0x00000000
#define _P2OVDCON_POUT1L_MASK                    0x00000001
#define _P2OVDCON_POUT1L_LENGTH                  0x00000001

#define _P2OVDCON_POUT1H_POSITION                0x00000001
#define _P2OVDCON_POUT1H_MASK                    0x00000002
#define _P2OVDCON_POUT1H_LENGTH                  0x00000001

#define _P2OVDCON_POVD1L_POSITION                0x00000008
#define _P2OVDCON_POVD1L_MASK                    0x00000100
#define _P2OVDCON_POVD1L_LENGTH                  0x00000001

#define _P2OVDCON_POVD1H_POSITION                0x00000009
#define _P2OVDCON_POVD1H_MASK                    0x00000200
#define _P2OVDCON_POVD1H_LENGTH                  0x00000001

